Revit 2027 API
BuiltInFailures.SketchFailures.BuildingPadNoSurfaceError Property
 A Pad can't extend beyond the edge of a Toposurface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BuildingPadNoSurfaceError { get; }
Public Shared ReadOnly Property BuildingPadNoSurfaceError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BuildingPadNoSurfaceError {
	FailureDefinitionId^ get ();
}
static member BuildingPadNoSurfaceError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace